/**
  ******************************************************************************
  * @file        CC2530.c
  * @author      BruceOu
  * @version     V1.0
  * @date        2018-01
  * @brief       继电器接开发板P9座子上，使用P0.4口控制继电器的信息端，
                 高电平继电器断开;低电平继电器吸合，并且继电器吸合指示灯亮 
  ******************************************************************************
  */
/**Includes*********************************************************************/
#include <ioCC2530.h>

/**宏定义***********************************************************************/
//定义数据类型
typedef unsigned char uchar;
typedef unsigned int  uint;

#define DATA_PIN P0_4        //定义P0.4定义为输入口

/**函数声明*********************************************************************/
void DelayMS(uint msec);


/**
  * @brief     主函数
  * @param     None
  * @retval    None
  */
void main(void)
{        
  P0DIR |= 0x10;           //P0.4定义为输出口   
  while(1)                 //死循环,继电器间隔3秒开关一次  
  {
    DATA_PIN = 1;        //继电器断开
    DelayMS(3000);  
    DATA_PIN = 0;        //继电器吸合     
    DelayMS(3000);
  }    
}

/**
  * @brief     以毫秒为单位延时 16M时约为535,系统时钟不修改默认为16M
  * @param     msec 延时参数，值越大，延时越久
  * @retval    None
  */
void DelayMS(uint msec)
{   
  uint i,j;
     
  for (i=0; i<msec; i++)   
    for (j=0; j<535; j++);
}



